task_code = {
    "help_status":{
        "1":"待处理", "3": "已受理", "5": "调度", "7": "出车", "9": "完成"
    },
    "help_sub_status":{
        "31":"正常", "32":"漏接", "33":"骚扰报警", "34":"已回拨", "35":"挂断", "36":"取消任务", "37":"正常完成"
    },
    "dispatch_status":{
        "11":"待处理", "12":"已受理", "13":"指派出车", "14":"出车中", "15":"完成", "16":"取消任务", "17":"骚扰报警", "18":"已被改派", "21":"已调度分站", "22":"分站接受任务", "23":"分站拒绝任务", "24":"分站取消任务", "25":"电话调度接听后挂断"
    },
    "car_out_status":{
        "41":"待处理", "42":"医生接受", "43":"医生拒绝", "44":"司机接受", "45":"司机拒绝", "46":"准备出车", "47":"已出发", "48":"已达现场", "49":"返程中", "50":"已达就诊医院", "51":"医生取消", "52":"司机取消", "53":"被改派", "54":"分站取消", "55":"中心取消", "56":"骚扰报警", "57":"(超时自动拒绝)拒绝"
    }
}
# 暂时使用写死数据，后续迭代可以考虑直接数据库读取
unit_dict = {
    "center":{
        "unitId":"232",
        "siteId":{
            "site1":{
            "unitId":"233", "ambId":[109], "doctorId": [252], "driverId":[253]
            }, 
            # "site2":{
            # "unitId":"116", "ambId":[62, 63], "doctorId": [], "driverId":[]
            # }, 
        }
    },
    "sub":{
        "unitId":"76",
        "siteId":{
            82:{
            "ambId":[48, 50, 51, 52], "doctorId": [64, 71, 168], "driverId":[65, 166, 167, 169]
            }, 
            116:{
            "ambId":[62, 63], "doctorId": [], "driverId":[]
            }, 
        },
    }
}